<a href="https://colab.research.google.com/github/searanIm/bigdata/blob/master/Pandas%20%EA%B3%B5%EB%B6%80.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

\{:toc}

# < 참고 사이트>
- https://datascienceschool.net/view-notebook/ee0a5679dd574b94b55193690992f850/
- https://dataitgirls2.github.io/10minutes2pandas/
- https://www.slideshare.net/TaeYoungLee1/1-115587182?from_action=save
- https://dandyrilla.github.io/2017-08-12/pandas-10min/#ch3

# 0. Pandas 사용하기

- pandas 를 사용하기 위해서 관례적으로 다음과 같이 모듈을 임포트(import) 한다.  
- pandas 외에도 배열 구조나 랜덤 값 생성 등의 기능을 활용하기 위한 numpy와 그래프를 그리기 위한 matplotlib도 함께 임포트 해준다.

In [0]:
# 코랩에서 구글드라이브 이용
from google.colab import drive

drive.mount('/content/gdrive')

Drive already mounted at /content/gdrive; to attempt to forcibly remount, call drive.mount("/content/gdrive", force_remount=True).

In [0]:
# 로컬파일 업로드

from google.colab import files
uploaded=files.upload()

Saving gapminder.tsv to gapminder.tsv

In [0]:
import pandas as pd #판다스 모듈을 불러오기
import numpy as np #넘파이 모듈을 불러오기
import matplotlib.pyplot as plt #matplotlib 모듈을 불러오기
from pandas import Series, DataFrame

# 1. Pandas 패키지의 소개



- Numpy 기반으로 개발되어 고성능 데이터 분석 가능
- R언어에서 제공하는 DataFrame 자료형 제공
- 명시적으로 축의 이름에 따라 데이터 정렬 가능한 자료구조
- 통합된 Time Series 분석 기능
- 누락된 데이터를 유연하게 처리할 수 있는 기능
- 구조화된데이터의처리를지원하는Python 라이브러리
- 대부분의 데이터는 시계열(series)이나 표(table)의 형태로 나타낼 수 있는데 Pandas 패키지에서는 이러한 표 데이터를 다루기 위한 **시리즈(Series) 클래스**와 **데이터프레임(DataFrame) 클래스**를 제공한다.

**< 참고 : 판다스와 파이썬 자료형 비교>**

| 판다스 자료형 | 파이썬 자료형 |      설명      | 
|--------|--------|--------|
|     object   |  string      |        문자열        |
|   int64     |   int     |   정수      |      
|   float64     |   float     |  수수점을 가진 숫자       |
|   datetime64     |   datetime     |  파이썬 표준 라이브러리인 datetime이 반환하는 자료형       |

## 1.  Series 클래스

- 시리즈 클래스는 NumPy에서 제공하는 1차원 배열과 비슷하지만, 각 데이터의 의미를 표시하는 행방향 인덱스(index)를 붙일 수 있다. 데이터 자체는 값(value)라고 한다.
- 쉽게 말헤 1차원 벧터 데이터에 행방향 인덱스를 붙인 것 
- 즉,  **시리즈 = 값(value) + 인덱스(index)**

### 1-1. Series (시리즈) 생성하기

데이터를 리스트나 1차원 배열 형식으로 Series 클래스 생성자에 넣어주면 시리즈 클래스 객체를 만들 수 있다. 
인덱스의 길이는 **데이터의 길이와 같아야 한다.** 
아래의 예에서 이 '서울','부산' 등의 문자열이 인덱스의 값이다. 
**인덱스의 값을 인덱스 라벨(label)**이라고 하며, 이 인덱스 라벨은 문자열 뿐만 아니라 날짜, 시간, 정수 등도 가능하다.

아래 예제는 각 도시의 2015 인구데이터를 시리즈로 만든것이다.

In [0]:
s = pd.Series([9904312, 3448737, 2890451, 2466052],
              index=["서울", "부산", "인천", "대구"])
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

만약 인덱스를 지정하지 않고 시리즈를 만들면 기본적인 시리즈의 인덱스는 **0부터 시작하는 정수값**이 된다.

In [0]:
pd.Series(range(10,14))

0    10
1    11
2    12
3    13
dtype: int64

시리즈의 인덱스는 **index 속성**으로 접근할 수 있다.

In [0]:
s.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

시리즈의 값은 1차원 배열이며, **value 속성**으로 접근할 수 있다.

In [0]:
s.values

array([9904312, 3448737, 2890451, 2466052])

**name 속성**을 이용하면 시리즈 데이터에 이름을 붙일 수 있다.   
또한 **index.name 속성** 으로 시리즈의 인덱스에도 이름을 붙일 수 있다.

In [0]:
s.name='인구'
s.index.name='도시'

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 인구, dtype: int64

### 1-2 Series (시리즈) 연산

NUMPY 배열처럼 시리즈도 벡터화 연산을 할 수 있다. 다만 연산은 시리즈의 값에만 적용되며 인덱스 값은 변하지 않는다. 예를 들어 인구 숫자를 백만 단위로 만들기 위해 시리즈 객체를 1,000,000 으로 나누어도 인덱스 라벨에는 영향을 미치지 않는 것을 볼 수 있다

In [0]:
s

서울    9904312
부산    3448737
인천    2890451
대구    2466052
dtype: int64

In [0]:
s / 1000000

서울    9.904312
부산    3.448737
인천    2.890451
대구    2.466052
dtype: float64

### 1-3. Series (시리즈)  인덱싱

시리즈는 numpy 배열에서 가능한 인덱스 방법 외에도 인덱스 라벨을 이용한 인덱싱도 할 수 있다. 배열 인덱싱이나 인덱스 라벨을 이용한 슬라이싱도 가능하다.

In [0]:
s[1], s["부산"]

(3448737, 3448737)

In [0]:
s[3],s['대구']

(2466052, 2466052)

배열 인덱싱을 하면 자료의 순서를 바꾸거나 특정한 자료만 선택할 수 있다.

In [0]:
s[[0,3,1]]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [0]:
s[['서울','대구','부산']]

서울    9904312
대구    2466052
부산    3448737
dtype: int64

In [0]:
s[(250e4<s)&(s<500e4)]

부산    3448737
인천    2890451
dtype: int64

숫자라벨을 이용한 슬라이싱을 하는 경우에는 콜론 뒤에 오는 인덱스에 해당하는 값은 결과에 포함되지 않는다.

In [0]:
s[1:3]

부산    3448737
인천    2890451
dtype: int64

문자열 라벨을 이용한 슬라이싱을 하는 경우에는 콜론(:)뒤에 오는 인덱스에 해당하는 값도 결과에 포함되므로 주의해야 한다.

In [0]:
s['부산' : '대구']

부산    3448737
인천    2890451
대구    2466052
dtype: int64

만약 **라벨 값이 영문 문자**인 경우에는 마치 속성인것 처럼 점(.)을 이용해 접근할 수 도 있다.

In [0]:
s0=pd.Series(range(3),index=['a','b','c'])
s0

a    0
b    1
c    2
dtype: int64

In [0]:
s0.a

0

In [0]:
s0.b

1

### 1-4. 시리즈와 딕셔너리 자료형

시리즈 객체는 라벨 값에 의해 인덱싱이 가능하므로 실질적으로 라벨값을 키(key)로 가지는 딕셔너리 자료형과 같다고 볼 수 있다. 따라서 딕셔너리 자료형에서 제공하는 in 연산도 가능하고 items 메서드를 사용하면 for 루프를 통해 각 원소의  키(key)와 값(value)을 접근할 수 도 있다.

      
      
**< 참고 - 딕셔너리 자료형 다루기>**

- https://datascienceschool.net/view-notebook/3ed4a1e949f14ff08bcf773705afee8e/

In [0]:
'서울' in s

True

In [0]:
'대전' in s

False

In [0]:
for i,j in s.items():
  print('%s = %d'%(i,j))

서울 = 9904312
부산 = 3448737
인천 = 2890451
대구 = 2466052

또 딕셔너리 객체에서 시리즈를 만들 수도 있다. 이번에는 2010년의 인구자료를 s2라는 이름의 시리즈로 만들어겠다. 
이 데이터에는 대구의 인구자료는 없지만 대신 대전의 인구 자료가 포함되어 있다.

In [0]:
s2 = pd.Series({ "서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 149015})
s2

서울    9631482
부산    3393191
인천    2632035
대전     149015
dtype: int64

딕셔너리의 원소는 순서를 가지지 않으므로 시리지의 데이터도 순서가 보장되지 않는다. 만약 순서를 정하고 싶다면 인덱스를 리스트로 지정해줘야한다.

In [0]:
s2 = pd.Series({ "서울": 9631482, "부산": 3393191, "인천": 2632035, "대전": 149015}, index=['부산','대전','인천','서울'])
s2

부산    3393191
대전     149015
인천    2632035
서울    9631482
dtype: int64

### 1-5 인덱스 기반 연산

이번에는 2015년도와 2010년의 인구 증가를 계산해 보겠다. 두 개의 시리즈의 차이를 구하면 된다. 두 시리즈에 대해 연산을 하는 경우 인덱스가 같은 데이터에 대해에서만 차이를 구한다.

In [0]:
ds=s-s2
ds

대구         NaN
대전         NaN
부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

In [0]:
s.values - s2.values

array([ 6511121,  3299722,   258416, -7165430])

대구와 대전의 경우에는 2010년 자료와 2015년 자료가 모두 존재하지 않기 때문에 계산이 불가능하므로 NaN(Not a Number) 이라는 값을 가지게 된다. 또한 NaN 값이 float 자료형에서만 가능하므로 다른 계산 결과도 모두 float자료형이 되었다는 점에 주의해야함
NaN이 아닌 값을 구하려면 notnull이라는 메서드를 사용한다

In [0]:
ds.notnull()

대구    False
대전    False
부산     True
서울     True
인천     True
dtype: bool

In [0]:
ds[ds.notnull()]

부산     55546.0
서울    272830.0
인천    258416.0
dtype: float64

마찬가지로 인구증가율(%) 은 다음과 같이 구할 수 있다.

In [0]:
rs=(s-s2) / s2* 100
rs = rs[rs.notnull()]
rs

부산    1.636984
서울    2.832690
인천    9.818107
dtype: float64

### 1-6 . 데이터의 갱신, 추가, 삭제
인덱싱을 이용하면 딕셔너리처럼 데이터를 갱신(update) 하거나, 추가할 수 있다.

In [0]:
rs['부산']=1.63
rs

부산    1.630000
서울    2.832690
인천    9.818107
dtype: float64

In [0]:
rs['대구']=1.41
rs

부산    1.630000
서울    2.832690
인천    9.818107
대구    1.410000
dtype: float64

데이터를 삭제할 때도 딕셔너리처럼 del 명령어를 사용한다.

In [0]:
del rs['서울']
rs

부산    1.630000
인천    9.818107
대구    1.410000
dtype: float64

### 시리즈 연습문제

1. 임의로 두 개의 시리즈 객체를 만든다. 모두 문자열 인덱스를 가져야 하며 두 시리즈에 공통적으로 포함되지 않는 라벨이 있어야 한다. 
2. 위에서 만든 두 시리즈 객체를 이용하여 사칙연산을 한다.

In [0]:
#  리스트로 시리즈 만들기 
s1=pd.Series([123,456,789],index=['a','b','c'])

# 딕셔너리로 시리즈 만들기 
s2=pd.Series({'a':100,'e':200, 'f':300},index=['a','e','f'])

In [0]:
# 2. 사칙연산하기
print(s1-s2)
print(s1+s2)
print(s1/s2)
print(s1*s2)

a    23.0
b     NaN
c     NaN
e     NaN
f     NaN
dtype: float64
a    223.0
b      NaN
c      NaN
e      NaN
f      NaN
dtype: float64
a    1.23
b     NaN
c     NaN
e     NaN
f     NaN
dtype: float64
a    12300.0
b        NaN
c        NaN
e        NaN
f        NaN
dtype: float64

## 2. DataFrame 클래스

- 2차원 행렬 데이터에 인덱스를 붙인 것 
- 2차원이므로 각각의 행 데이터의 이름이 되는 행 방향 인덱스 뿐만 아니라, 각각의 열데이터의 이름이 되는 열방향 인덱스도 붙일 수 있다. 
- 즉, 레이블(Labeled)된 행(Column)과 열(Row)을 가진 2차원 데이터구조
- 칼럼 마다 데이터 형식이 다를 수 있음
- 각 행(Column)과 열(Row)들을 산술연산이 가능한 구조
- DataFrame 크기는 유동적으로 변경 가능
- DataFrame끼리 여러 가지 조건을 사용한 결합처리 가능


[![pandas.png](https://i.postimg.cc/sx95Kj5Y/pandas.png)](https://postimg.cc/YL04Cwn0)


[![2.jpg](https://i.postimg.cc/9M1WBsr4/2.jpg)](https://postimg.cc/ZBBtb7PZ)
[![3.jpg](https://i.postimg.cc/hv5ckx8c/3.jpg)](https://postimg.cc/PvYgZCFR)

### 2-1. Dataframe (데이터프레임) 생성하기

데이터 프레임을 만드는 법은 다양하다. 가장 간단한 방법은 다음과 같다.    


1.   우선 하나의 열이 되는 데이터를 리스트나 일차원 배열 형태로 준비한다. 
2.   각각의 열에 대한 이름(라벨)을 키로 가지는 딕셔너리를 만든다.
3.  이 데이터를 dataframe 클래스 생성자에 넣는다. 동시에 열방향 인덱스는 columns인수로, 행방향 인덱스는 index 인수로 지정한다.

In [0]:
# 1.열 데이터를 리스트로 만들고, 열이름을 키로 가지는 딕셔너리를 만들기

data = {
'2015':[9904312, 3448737, 2890451, 2466052],
"2010": [9631482, 3393191, 2632035, 2431774],
"2005": [9762546, 3512547, 2517680, 2456016],
"2000": [9853972, 3655437, 2466338, 2473990],
"지역": ["수도권", "경상권", "수도권", "경상권"],
"2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
} 

columns=["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
index=['서울','부산','인천','대구']
df=pd.DataFrame(data,index=index,columns=columns)
df.head()

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

앞에서 데이터프레임은 2차원 배열 데이터를 기반으로 한다고 했지만 사실은 **공통인덱스를 가지는 열 시리즈를 딕셔너리로 묶어놓은 것** 이라고 보는것이 더 정확하다. 2차서도 지역, 인구, 증가율은 각각 문자열, 정수, 부동소수점 실수이다.

데이터 프레임을 만드는 다른 방법은 numpy array 를 받아 생성이 가능하다. 아래 예시에는 인덱스로 날짜값을 주었고, 컬럼의 이름도 같이 넣어보았다.

In [0]:
dates = pd.date_range('20130101', periods=6)
print(dates)
df = pd.DataFrame(np.random.randn(6,4), index=dates, columns=list('ABCD'))
print('----------------------------')
print(df)

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')
----------------------------
                   A         B         C         D
2013-01-01  0.017959  0.089342 -0.598767  0.140331
2013-01-02  0.144478 -1.727588 -0.731951  0.558632
2013-01-03  0.429491 -0.999024 -0.588511  1.165106
2013-01-04  1.323160  0.360980  1.716882  0.703662
2013-01-05 -0.835705 -1.917271 -0.173834 -0.045342
2013-01-06 -0.917635  0.161626 -0.854749  1.216539

시리즈와 마찬가지로 데이터에 접근하려면 values 속성을 이용한다. 열방향 인덱스와 행 방향 인덱스는 각각 columns , index 속성으로 접근한다.

In [0]:
df.values

array([[ 0.01795924,  0.08934237, -0.59876657,  0.14033139],
       [ 0.14447809, -1.72758798, -0.73195081,  0.55863184],
       [ 0.42949103, -0.99902369, -0.5885114 ,  1.16510633],
       [ 1.32316002,  0.36097962,  1.71688193,  0.70366194],
       [-0.8357046 , -1.91727106, -0.17383448, -0.04534213],
       [-0.91763476,  0.16162633, -0.85474895,  1.21653854]])

In [0]:
df. columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [0]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

시리즈에서 처럼 열방향 인덱스와 행방향 인덱스에 이름을 붙이는 것도 가능하다.

In [0]:
df.columns.name = '특성'
df.index.name='도시'
df

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

데이터 프레임은 전치(transpose)를 포함하여 numpy 2차원 배열이 가지는 대부분의 속성이나 메서드를 지원한다.

In [0]:
df.T

                    서울       부산       인천       대구
지역                 수도권      경상권      수도권      경상권
2015           9904312  3448737  2890451  2466052
2010           9631482  3393191  2632035  2431774
2005           9762546  3512547  2517680  2456016
2000           9853972  3655437  2466338  2473990
2010-2015 증가율   0.0283   0.0163   0.0982   0.0141

#### < 연습 문제 2 >

다음 조건을 만족하는 임의의 데이터프레임을 하나 만든다.

1. 열의 갯수와 행의 갯수가 각각 5개 이상이어야 한다.
2. 열에는 정수, 문자열, 실수 자료형 데이터가 각각 1개 이상씩 포함되어 있어야 한다.

In [0]:
data={
'int1':[1,2,3,4,5],
'int2':[6,7,8,9,10],
'int3':[11,12,13,14,15],
'object':['a','b','c','d','e'],
'float':[1.0,2.0,3.0,4.0,5.0]
}

columns= ['int1','int2','int3','object','float']
index= ['as','sd','sfd','sdf','sdfd']
pd.DataFrame(data,index=index,columns=columns)

      int1  int2  int3 object  float
as       1     6    11      a    1.0
sd       2     7    12      b    2.0
sfd      3     8    13      c    3.0
sdf      4     9    14      d    4.0
sdfd     5    10    15      e    5.0

### 2-2. 열데이터의 갱신, 추가, 삭제
데이터 프레임은 열 시리즈의 딕셔너리로 볼 수 있으므로 열 단위로 데이터를 갱신하거나, 추가,삭제할 수 있다.

In [0]:
df["2010-2015 증가율"] = df["2010-2015 증가율"] * 100
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83
부산  경상권  3448737  3393191  3512547  3655437           1.63
인천  수도권  2890451  2632035  2517680  2466338           9.82
대구  경상권  2466052  2431774  2456016  2473990           1.41

In [0]:
#round(number[, ndigits]) 함수는 숫자를 입력받아 반올림해 주는 함수이다.
df['2005-2010 증가율']=((df['2010']-df['2005'])/df['2005']*100).round(2)
df

     지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972           2.83          -1.34
부산  경상권  3448737  3393191  3512547  3655437           1.63          -3.40
인천  수도권  2890451  2632035  2517680  2466338           9.82           4.54
대구  경상권  2466052  2431774  2456016  2473990           1.41          -0.99

In [0]:
del df['2010-2015 증가율']
df

     지역     2015     2010     2005     2000  2005-2010 증가율
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54
대구  경상권  2466052  2431774  2456016  2473990          -0.99

### 2-3 열인덱싱

데이터 프레임은 열 시리즈의 딕셔너리와 비슷하다. 따라서 데이터프레임을 인덱싱을 할 때도 열라벨을 키값으로 생각하여 인덱싱을 할 수 있다. 인덱스로 라벨값을 하나만 넣으면 시리즈 객체가 반환되고, 라벨의 배열 또는 리스트를 넣으면 부분적인 데이터 프레임이 반환된다.

In [0]:
# 인덱스로 라벨값을 하나 넣기
df['지역']

도시
서울    수도권
부산    경상권
인천    수도권
대구    경상권
Name: 지역, dtype: object

In [0]:
#라벨의 리스트 넣기
df[['2010','2015']]

특성     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

만약 하나의 열만 빼내면서 데이터프레임 자료형을 유지하고 싶다면 원소가 하나인 리스트를 써서 인덱싱하면 된다.

In [0]:
df[['2010']]

특성     2010
도시
서울  9631482
부산  3393191
인천  2632035
대구  2431774

In [0]:
type(df[['2010']])

pandas.core.frame.DataFrame

In [0]:
df['2010']

도시
서울    9631482
부산    3393191
인천    2632035
대구    2431774
Name: 2010, dtype: int64

In [0]:
type(df['2010'])

pandas.core.series.Series

데이터프레임의 열 인덱스가 문자열 라벨을 가지고 있는 경우에는 순서를 나타내는 정수인덱스를 열 인덱싱에 사용할 수 없다. 정수 인덱싱의 슬라이스는 뒤에서 설명하겠지만 행(row)을 인덱싱할 때 사용하므로 열을 인덱싱할 때는 쓸 수 없다. 정수 인덱스를 넣으면 keyerror 오류가 발생하는 것을 볼 수 있다.

In [0]:
# try 블록 수행 중 오류가 발생하면 except 블록이 수행된다.
#하지만 try 블록에서 오류가 발생하지 않는다면 except 블록은 수행되지 않는다.
try: 
  df[0]
except Exception as e:
  print(type(e))

<class 'KeyError'>

다만 원래부터 문자열이 아닌 정수형 열 인덱스를 가지는 경우에는 인덱스값으로 정수를 사용할 수 있다.

In [0]:
df2 = pd.DataFrame(np.arange(12).reshape(3, 4))
df2

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [0]:
df2[2]

0     2
1     6
2    10
Name: 2, dtype: int64

In [0]:
df2[[1,2]]

   1   2
0  1   2
1  5   6
2  9  10

### 2-4 행 인덱싱

만약 행 단위로 인덱싱을 하고자 하면 항상 슬라이싱(slicing)을 해야한다. 인덱스의 값이 문자라벨이면 라벨 슬라이싱도 가능하다. 문자슬라이싱은 : 뒤의 값도 포함됨 !

In [0]:
df[:1]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34

In [0]:
df[1:2]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437           -3.4

In [0]:
df[0:3]

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40
인천  수도권  2890451  2632035  2517680  2466338           4.54

In [0]:
df['서울':'부산']

특성   지역     2015     2010     2005     2000  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972          -1.34
부산  경상권  3448737  3393191  3512547  3655437          -3.40

### 2-5. 개별 데이터 인덱싱
데이터프레임에서 열 라벨로 시리즈를 인덱싱하면 시리즈가 된다. 이 시리즈를 다시 행라벨로 인덱싱하면 개별 데이터가 나온다.

In [0]:
df['2015']

도시
서울    9904312
부산    3448737
인천    2890451
대구    2466052
Name: 2015, dtype: int64

In [0]:
df['2015']['서울']

9904312

### 데이터프레임 인덱싱 방법 총 정리  
  
| 인덱싱값 | 가능 | 결과 | 자료형 | 추가사항 |
|--------|--------|--------|--------|--------|
|   라벨     |   O     |    열    |    시리즈    |        |
|   라벨리스트     |    O    |   열     |    데이터프레임    |        |
| 인덱스데이터(정수)       |   X     |        |        |    열 라벨이 정수인 경우에는 라벨 인덱싱으로 인정    |
|    인덱스데이터(정수)슬라이스    |   O     |   행     |   데이터프레     |        |

### <연습문제 3>
다음 데이터프레임에서 지정하는 데이터를 뽑아내거나 처리하라.

In [0]:
data = {
    "국어": [80, 90, 70, 30],
    "영어": [90, 70, 60, 40],
    "수학": [90, 60, 80, 70],
}
columns = ["국어", "영어", "수학"]
index = ["춘향", "몽룡", "향단", "방자"]
df = pd.DataFrame(data, index=index, columns=columns)

1. 모든 학생의 수학 점수를 시리즈로 나타낸다.
2. 모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
3. 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
4. 방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
5. 춘향의 점수를 데이터프레임으로 나타낸다.
6. 향단의 점수를 시리즈로 나타낸다.

In [0]:
# 모든 학생의 수학 점수를 시리즈로 나타낸다.
df['수학']

춘향    90
몽룡    60
향단    80
방자    70
Name: 수학, dtype: int64

In [0]:
#모든 학생의 국어와 영어 점수를 데이터 프레임으로 나타낸다.
df[['국어','영어']]

    국어  영어
춘향  80  90
몽룡  90  70
향단  70  60
방자  30  40

In [0]:
# 모든 학생의 각 과목 평균 점수를 새로운 열로 추가한다.
df['과목 평균점수']=(df['국어']+df['영어']+df['수학'])/3
df

    국어  영어  수학    과목 평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  40  70  46.666667

In [0]:
#방자의 영어 점수를 80점으로 수정하고 평균 점수도 다시 계산한다.
df['영어']['방자']=80
df['과목 평균점수']=(df['국어']+df['영어']+df['수학'])/3

df

/usr/local/lib/python3.6/dist-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.

    국어  영어  수학    과목 평균점수
춘향  80  90  90  86.666667
몽룡  90  70  60  73.333333
향단  70  60  80  70.000000
방자  30  80  70  60.000000

In [0]:
# 춘향의 점수를 데이터프레임으로 나타낸다.
df[:1]

    국어  영어  수학    과목 평균점수
춘향  80  90  90  86.666667

In [0]:
# 향단의 점수를 시리즈로 나타낸다.
a=df.T
a['향단']

국어         70.0
영어         60.0
수학         80.0
과목 평균점수    70.0
Name: 향단, dtype: float64

# 2. 데이터 입출력

pandas 는 데이터 파일을 읽어 데이터프레임을 만들 수 있다. 다음처럼 여러가지 포맷을 지원한다. 
- csv
- excel
- html
- json
- hdf5
- sas
- stata
- sql   
여기서에는 가장 단순하지만 널리 사용되는 csv 포맷입출력에 대해 살펴본다. csv 파일 포맷은 데이터 값이 쉼표(,) 로 구분되는 텍스트 파일이다.

## 2-1. %%writefile 명령 
샘플 데이터로 사용할 csv 파일을  %%writefile 매직 명령으로 만들어볼것임. 이 명령은 셀에 서술한 내용대로 텍스트 파일을 만드는 명령이다.

In [0]:
!rm -rf sample?.*

In [0]:
%%writefile sample1.csv
c1,c2,c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

## 2-2. CSV 파일 입력
csv 파일로부터 데이터를 읽어 데이터프레임을 만들 때는 pandas.read_csv() 명령을 사용한다.

In [0]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

위에서 읽은 데이터에는 열 인덱스는 있지만 행 인덱스 정보가 없으므로 0부터 시작하는 정수 인덱스가 자동으로 추가되었다. 만약, 위의 경우와 달리, 데이터 파일에 열 인덱스 정보가 없는 경우에는 read_csv 명령의 names 인수로 설정할 수 있다.

In [0]:
%%writefile sample2.csv
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample2.csv

In [0]:
pd.read_csv('sample2.csv',names=['c1','c2','c3'])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

만약 테이블 내의 특정한 열을 행 인덱스로 지정하고 싶으면 index_col 인수를 사용한다.

In [0]:
pd.read_csv('sample1.csv', index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

확장자가 csv가 아닌 파일 즉, 데이터를 구분하는 구분자가 쉼표가 아니면 sep 인수를 써서 구분자를 사용자가 지정해준다. 만약 구분자가 길이가 정해지지않은 공백인 경우에는 \s+라는 정규식 문자열을 사용한다.

In [0]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [0]:
pd.read_csv('sample3.txt', sep='\s+')

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

만약 자료 파일 중에 건너 뛰어야 할 행이 있으면 skiprows 인수를 사용한다.

In [0]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [0]:
pd.read_csv('sample4.txt',skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

특정한 값을 NaN 값으로 취급하고 싶으면 na_values 인수에 NaN 값으로 취급할 값을 넣는다.

In [0]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [0]:
df=pd.read_csv('sample5.csv',na_values=['누락'])
df

    c1     c2      c3
0  1.0   1.11     one
1  2.0            two
2  NaN   3.33   three

## 2-3. csv 파일 출력
파이썬의 데이터프레임 값을 csv 파일로 출력하고 싶으면 to_csv()  메서드를 사용한다.

In [0]:
df.to_csv('sample6.csv')

리눅스나 맥에서는 cat 셸 명령으로 파일의 내용을 확인할 수 있다. 윈도우에서는 type 명령을 사용한다. 느낌표(!)는 셸 명령을 사용하기 위한 IPython 매직 명령이다.

In [0]:
!cat sample6.csv

,c1, c2, c3
0,1.0, 1.11, one
1,2.0, , two
2,, 3.33, three

In [0]:
df.to_csv('sample7.txt', sep='|')

In [0]:
!cat sample7.txt

|c1| c2| c3
0|1.0| 1.11| one
1|2.0| | two
2|| 3.33| three

또 na_rep 인수로 NaN표시값을 바꿀 수도 있다.

In [0]:
df.to_csv('sample8.csv',na_rep='누락')

In [0]:
!cat sample8.csv

,c1, c2, c3
0,1.0, 1.11, one
1,2.0, , two
2,누락, 3.33, three

index, header 인수를 지정하여 인덱스 및 헤더 출력 여부를 지정하는 것도 가능하다.

In [0]:
df.index=['a','b','c']
df

    c1     c2      c3
a  1.0   1.11     one
b  2.0            two
c  NaN   3.33   three

In [0]:
df.to_csv('sample9.csv',index=False, header=False)

In [0]:
! cat sample9.csv

1.0, 1.11, one
2.0, , two
, 3.33, three

## 2-4. 인터넷 상의 csv 파일 입력
웹상에는 다양한 데이터 파일이 csv 파일 형태로 제공된다. read_csv 명령 사용시 파일 패스(경로) 대신 url응 지정하면 pandas가 직접 해당 파일을 다운로드 하여 읽어들인다. 다음은 github 웹사이트에 저장되어 있는 데이터 파일을 원격으로 읽는 명령이다.

In [0]:
df=pd.read_csv('https://raw.githubusercontent.com/datascienceschool/docker_rpython/master/data/titanic.csv')

이 데이터프레임은 실제로 데이터 갯수, 즉 행의 수가 890개가 넘는 대량의 데이터이다. 이렇게 데이터의 수가 많을 경우, 데이터프레임의 표현은 데이터 앞,뒤의 일부분만 보여준다. 보여줄 행의 수는 display.max_rows 옵션으로 정할 수 있다.

In [0]:
pd.set_option("display.max_rows", 20)  # 앞뒤로 모두 20행만 보여준다.
df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
5              6         0       3  ...   8.4583   NaN         Q
6              7         0       1  ...  51.8625   E46         S
7              8         0       3  ...  21.0750   NaN         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
..           ...       ...     ...  ...      ...   ...       ...
881          882         0       3  ...   7.8958   NaN         S
882          883         0       3  ...  10.5167   NaN         S
883          884         0       2  ...  10.5000   NaN         S
884          885         0       3  ...   7.0500   NaN         S
885          886         0       3  ...  29.1250   NaN         Q
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

만약 앞이나 뒤의 특정 갯수만 보고싶다면 head 메서드나 tail 메서드를 이용한다. 메서드 인수로 출력할 행의 수를 넣을 수 도 있다.

In [0]:
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [0]:
df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

## 2-5 인터넷 상의 데이터 베이스 자료 입력

pandas_datareader 패키지의 DataReader 을 사용하면 일부 인터넷 사이트의 자료를 바로 pandas로 읽어들일 수 있다. pandas_datareader 패키지는 판다스와 별도로 설치해야 한다. 다음은 pandas_datareader 패키지가 제공하는 인터넷 사이트의 예이다. 일부 인터넷 사이트는 유료이므로 별도의 가입절차를 거쳐야 한다.
- FRED
- Fama/French
- World Bank
- OECD
- Eurostat
- EDGAR Index
- TSP Fund Data
- Oanda currency historical rate
- Nasdaq Trader Symbol Definitions

자세한 내용은 다음 웹사이트를 참조한다.
- https://pandas-datareader.readthedocs.io/en/latest/index.html

날짜는 datatime 패키지를 사용하여 지정해도 되고 문자열을 바로 사용해도 된다. ( 이때는 내부적으로 dateutil 패키지를 사용한다. )

In [0]:
import datetime
dt_start = datetime.datetime(2015, 1, 1)
dt_end = "2016, 6, 30"


data_source 인수로 데이터를 읽어올 웹 사이트를 지정한다. 데이터의 코드는 웹 사이트에서 검색하여 알아내야 한다. 다음은 FRED 데이터베이스에서 미국 국가총생산(GDP), 모든 항목을 포함한 소비자 가격 지수(CPIAUCSL), 식료품 및 연로를 제외한 소비자 가격 지수(CPILFESL)를 가져오는 예이다. 웹사이트에서 자세한 데이터에 대한 세부적인 사항이나 값을 확인할 수 있다.

- https://fred.stlouisfed.org/series/GDP
- https://fred.stlouisfed.org/series/CPIAUCSL
- https://fred.stlouisfed.org/series/CPILFESL

In [0]:
import pandas_datareader as pdr

gdp = pdr.get_data_fred('GDP', dt_start, dt_end)
gdp.tail()

                  GDP
DATE
2015-04-01  18219.405
2015-07-01  18344.713
2015-10-01  18350.825
2016-01-01  18424.283
2016-04-01  18637.253

데이터 코드에 리스트를 넣으면 여러개의 데이터를 동시에 가져온다

In [0]:
inflation = pdr.get_data_fred(["CPIAUCSL", "CPILFESL"], dt_start, dt_end)
inflation.tail()

            CPIAUCSL  CPILFESL
DATE
2016-02-01   237.469   245.684
2016-03-01   238.038   245.986
2016-04-01   238.827   246.477
2016-05-01   239.464   247.018
2016-06-01   240.167   247.431

In [0]:
!rm -rf sample?.*

# 3. 데이터프레임 고급 인덱싱

데이터프레임에서 특정한 데이터만 골라내는 것을 인덱싱 이라고 한다. 앞 절에서는 라벨, 라벨 리스트, 인덱스 데이터(정수) 슬라이스의 3가지 인덱싱 값을 사용하여 인덱싱을 하는 방법을 공부하였다. 그런데 pandas는 numpy 행렬과 같이 쉼표를 사용한 (행인덱스, 열 인덱스) 형식의 2차원 인덱싱을 지원하기 위해 다음과 같은 특별한 인덱서(indexer) 속성도 제공한다. 
- loc: 라벨값 기반의 2차원 인덱싱 
- iloc: 순서를 나타내는 정수 기반의 2차원 인덱싱 
- at: 라벨값 기반의 2차원 인덱싱 (한개의 스칼라 값만 찾는다)
- iat : 순서를 나타내는 정수 기반의 2차원 인덱싱

## 3-1. loc 인덱서

loc 인덱서는 다음처럼 사용한다. 
- df.loc[행인덱싱값]
- df.loc[행인덱싱값, 열인덱싱값]   

이 때 인덱싱 값은 다음 중 하나이다. 행 인덱싱값은 정수 또는 행 인덱스데이터이고 열 인덱싱값은 라벨문자열이다.   
- 인덱스데이터
- 인덱스데이터 슬라이스
- 인덱스데이터 리스트
- 같은 행 인덱스를 가지는 불리언 시리즈 (행 인덱싱의 경우)
- 또는 위의 값들을 반환하는 함수

다음과 같은 데이터프레임을 예로 들겠음

In [0]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

### 3-1-1. 인덱싱값을 하나만 받는 경우

만약 loc 인덱서를 사용하면서 인덱스를 하나만 넣으면 행(row)을 선택한다.   
인덱스데이터가 'a' 인 행을 고르면 해당하는 행이 시리즈로 출력된다. 시리즈라서 상하로 길게 출력되긴했지만 행을 가져오고 있다.

In [0]:
df.loc['a']

A    10
B    11
C    12
D    13
Name: a, dtype: int64

인덱스 데이터의 슬라이스도 가능하다.

In [0]:
df.loc['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

이 때는 사실 loc를 쓰지않는 경우와 같다

In [0]:
df['b':'c']

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

인덱스데이터의 리스트도 된다.

In [0]:
df.loc[["b",'c']]

    A   B   C   D
b  14  15  16  17
c  18  19  20  21

이 떄는 loc를 쓰지않으면 KeyError 오류가 발생한다.

In [0]:
df[["b",'c']]

KeyError: ignored

데이터베이스와 같은 인덱스를 가지는 불리언 시리즈도 행을 선택하는 인덱싱값으로 쓸 수 있다.

In [0]:
df.A > 15

a    False
b    False
c     True
Name: A, dtype: bool

In [0]:
df[df.A > 15]

    A   B   C   D
c  18  19  20  21

In [0]:
df.loc[df.A > 15]

    A   B   C   D
c  18  19  20  21

인덱스 대신 인덱스 값을 반환하는 함수를 사용할 수 도 있다. 다음 함수는 A열의 값이 12보다 큰 행만 선택한다.

In [0]:
def select_rows(df):
  return df.A>15

In [17]:
select_rows(df)

a    False
b    False
c     True
Name: A, dtype: bool

In [19]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

loc 인덱서가 없는 경우에 사용했던 라벨 인덱싱이나 라벨리스트 인덱싱은 불가능 하다

In [0]:
loc 인덱